In [1]:
import pandas as pd
import numpy as np

# Method #1: By declaring a new list as a column.

In [5]:
                  # Creating Dictionary
data = {'Name': ['Faisal', 'Ali', 'Ahmed', 'Usman'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

In [12]:
                    #Converting Dictionary into DataFrame
df =pd.DataFrame(data)
df

     Name  Height Qualification     Address
0  Faisal     5.1           Msc   Burnsroad
1     Ali     6.2            MA  Bahadrabad
2   Ahmed     5.1           Msc     Gulshan
3   Usman     5.2           Msc        Nipa

In [8]:
#               Declare a list that is to be converted into a column
address = ["Burnsroad","Bahadrabad","Gulshan","Nipa"]

In [13]:
#              Using 'Address' as the column name and equating it to the list 
df["Address"]= address

In [14]:
# Observe the result 
df

     Name  Height Qualification     Address
0  Faisal     5.1           Msc   Burnsroad
1     Ali     6.2            MA  Bahadrabad
2   Ahmed     5.1           Msc     Gulshan
3   Usman     5.2           Msc        Nipa

**Note** that the length of your list should match the length of the index column otherwise it will show an error.

# Method #2: By using DataFrame.insert()

**Working:**
It gives the freedom to add a column at any position we like and not just at the end. It also provides different options for inserting the column values.

**Syntax:**
    dataframe.insert(Position of a column(column Index),Column name,Column Value)

In [ ]:
df.insert(2, "Age", [21, 23, 24, 21], True)

# Method #3: Using Dataframe.assign() method

This method will create a new dataframe with new column added to the old dataframe.

In [24]:
# Using 'Address' as the column name and equating it to the list 
df2 = df.assign(Roll_Number = [1,2,3,4]) 
   
# Observe the result 
df2

     Name  Height  School  Age Qualification     Address  Roll_Number
0  Faisal     5.1      18   18           Msc   Burnsroad            1
1     Ali     6.2      20   20            MA  Bahadrabad            2
2   Ahmed     5.1      22   22           Msc     Gulshan            3
3   Usman     5.2      24   24           Msc        Nipa            4

# Method #4: By using a dictionary

In [28]:
Country = {'Karachi': 'Faisal', 'Islamabad': 'Ali', 
           'Sialkot': 'Ahmed', 'Faisalabad': 'Usman'} 
  
df['Country'] = Country 
  
# Observe the output 
df

     Name  Height  School  Age Qualification     Address     Country
0  Faisal     5.1      18   18           Msc   Burnsroad     Karachi
1     Ali     6.2      20   20            MA  Bahadrabad   Islamabad
2   Ahmed     5.1      22   22           Msc     Gulshan     Sialkot
3   Usman     5.2      24   24           Msc        Nipa  Faisalabad